# 01. 판다스 입문

**Series**

In [ ]:
import pandas as pd

In [ ]:
#Dictionary 형식 데이터를 1차원 자료로 환원
population1 = {'서울':9700000, '부산':4500000,'인천':4000000,'광주':2000000,'대구':2500000}
popu = pd.Series(population1)
popu

서울    9700000
부산    4500000
인천    4000000
광주    2000000
대구    2500000
dtype: int64

In [ ]:
#각 범주별 데이터 값 개수 count
popu.value_counts()

2500000    1
4500000    1
2000000    1
4000000    1
9700000    1
dtype: int64

In [ ]:
#시리즈 내 unique한 값 출력
popu.unique()

array([9700000, 4500000, 4000000, 2000000, 2500000])

In [ ]:
#시리즈 내 unique한 값의 개수 출력
popu.nunique()

5

**Dataframe**

In [ ]:
#시리즈를 데이터프레임으로 변환할 때 열 이름 부여해 변환
pd.DataFrame(popu, columns=['pop'])

        pop
서울  9700000
부산  4500000
인천  4000000
광주  2000000
대구  2500000

In [ ]:
import seaborn as sns

#붓꽃 데이터 불러오기
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
#index
iris.index

RangeIndex(start=0, stop=150, step=1)

In [ ]:
#columns - 열 이름
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [ ]:
#values
iris.values

array([[5.1, 3.5, 1.4, 0.2, 'setosa'],
       [4.9, 3.0, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.6, 1.4, 0.2, 'setosa'],
       [5.4, 3.9, 1.7, 0.4, 'setosa'],
       [4.6, 3.4, 1.4, 0.3, 'setosa'],
       [5.0, 3.4, 1.5, 0.2, 'setosa'],
       [4.4, 2.9, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.4, 3.7, 1.5, 0.2, 'setosa'],
       [4.8, 3.4, 1.6, 0.2, 'setosa'],
       [4.8, 3.0, 1.4, 0.1, 'setosa'],
       [4.3, 3.0, 1.1, 0.1, 'setosa'],
       [5.8, 4.0, 1.2, 0.2, 'setosa'],
       [5.7, 4.4, 1.5, 0.4, 'setosa'],
       [5.4, 3.9, 1.3, 0.4, 'setosa'],
       [5.1, 3.5, 1.4, 0.3, 'setosa'],
       [5.7, 3.8, 1.7, 0.3, 'setosa'],
       [5.1, 3.8, 1.5, 0.3, 'setosa'],
       [5.4, 3.4, 1.7, 0.2, 'setosa'],
       [5.1, 3.7, 1.5, 0.4, 'setosa'],
       [4.6, 3.6, 1.0, 0.2, 'setosa'],
       [5.1, 3.3, 1.7, 0.5, 'setosa'],
       [4.8, 3.4, 1.9, 0.2, 'setosa'],
       [5.0, 3.0, 1.6, 0.2, 'setosa'],
       [5.0, 3.4, 1.6, 0.4, 'setosa'],
       [5.2, 3.5, 1.5, 0.2, 'setosa'],
       [5.2, 3.4, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.6, 0.2, 'setosa'],
       [4.8, 3.1, 1.6, 0.2, 'setosa'],
       [5.4, 3.4, 1.5, 0.4, 'setosa'],
       [5.2, 4.1, 1.5, 0.1, 'setosa'],
       [5.5, 4.2, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.2, 1.2, 0.2, 'setosa'],
       [5.5, 3.5, 1.3, 0.2, 'setosa'],
       [4.9, 3.6, 1.4, 0.1, 'setosa'],
       [4.4, 3.0, 1.3, 0.2, 'setosa'],
       [5.1, 3.4, 1.5, 0.2, 'setosa'],
       [5.0, 3.5, 1.3, 0.3, 'setosa'],
       [4.5, 2.3, 1.3, 0.3, 'setosa'],
       [4.4, 3.2, 1.3, 0.2, 'setosa'],
       [5.0, 3.5, 1.6, 0.6, 'setosa'],
       [5.1, 3.8, 1.9, 0.4, 'setosa'],
       [4.8, 3.0, 1.4, 0.3, 'setosa'],
       [5.1, 3.8, 1.6, 0.2, 'setosa'],
       [4.6, 3.2, 1.4, 0.2, 'setosa'],
       [5.3, 3.7, 1.5, 0.2, 'setosa'],
       [5.0, 3.3, 1.4, 0.2, 'setosa'],
       [7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [6.3, 3.3, 6.0, 2.5, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [7.1, 3.0, 5.9, 2.1, 'virginica'],
       [6.3, 2.9, 5.6, 1.8, 'virginica'],
       [6.5, 3.0, 5.8, 2.2, 'virginica'],
       [7.6, 3.0, 6.6, 2.1, 'virginica'],
       [4.9, 2.5, 4.5, 1.7, 'virginica'],
       [7.3, 2.9, 6.3, 1.8, 'virginica'],
       [6.7, 2.5, 5.8, 1.8, 'virginica'],
       [7.2, 3.6, 6.1, 2.5, 'virginica'],
       [6.5, 3.2, 5.1, 2.0, 'virginica'],
       [6.4, 2.7, 5.3, 1.9, 'virginica'],
       [6.8, 3.0, 5.5, 2.1, 'virginica'],
       [5.7, 2.5, 5.0, 2.0, 'virginica'],
       [5.8, 2.8, 5.1, 2.4, 'virginica'],
       [6.4, 3.2, 5.3, 2.3, 'virginica'],
       [6.5, 3.0, 5.5, 1.8, 'virginica'],
       [7.7, 3.8, 6.7, 2.2, 'virginica'],
       [7.7, 2.6, 6.9, 2.3, 'virginica'],
       [6.0, 2.2, 5.0, 1.5, 'virginica'],
       [6.9, 3.2, 5.7, 2.3, 'virginica'],
       [5.6, 2.8, 4.9, 2.0, 'virginica'],
       [7.7, 2.8, 6.7, 2.0, 'virginica'],
       [6.3, 2.7, 4.9, 1.8, 'virginica'],
       [6.7, 3.3, 5.7, 2.1, 'virginica'],
       [7.2, 3.2, 6.0, 1.8, 'virginica'],
       [6.2, 2.8, 4.8, 1.8, 'virginica'],
       [6.1, 3.0, 4.9, 1.8, 'virginica'],
       [6.4, 2.8, 5.6, 2.1, 'virginica'],
       [7.2, 3.0, 5.8, 1.6, 'virginica'],
       [7.4, 2.8, 6.1, 1.9, 'virginica'],
       [7.9, 3.8, 6.4, 2.0, 'virginica'],
       [6.4, 2.8, 5.6, 2.2, 'virginica'],
       [6.3, 2.8, 5.1, 1.5, 'virginica'],
       [6.1, 2.6, 5.6, 1.4, 'virginica'],
       [7.7, 3.0, 6.1, 2.3, 'virginica'],
       [6.3, 3.4, 5.6, 2.4, 'virginica'],
       [6.4, 3.1, 5.5, 1.8, 'virginica'],
       [6.0, 3.0, 4.8, 1.8, 'virginica'],
       [6.9, 3.1, 5.4, 2.1, 'virginica'],
       [6.7, 3.1, 5.6, 2.4, 'virginica'],
       [6.9, 3.1, 5.1, 2.3, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [6.8, 3.2, 5.9, 2.3, 'virginica'],
       [6.7, 3.3, 5.7, 2.5, 'virginica'],
       [6.7, 3.0, 5.2, 2.3, 'virginica'],
       [6.3, 2.5, 5.0, 1.9, 'virginica'],
       [6.5, 3.0, 5.2, 2.0, 'virginica'],
       [6.2, 3.4, 5.4, 2.3, 'virginica'],
       [5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)

In [ ]:
#shape 
iris.shape

(150, 5)

In [ ]:
iris.shape[0]

150

In [ ]:
#dtypes - 데이터 타입 확인 가능
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [ ]:
#len - 행의 길이 확인
len(iris)

150

In [ ]:
#size - 행의 개수(150) * 열의 개수(5) = 값의 개수(750)
iris.size

750

In [ ]:
#head() - default = 5
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
#tail()
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
#describe - 실수 타입 열 별 통계량, 결측치 제외
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
#info() - 데이터프레임의 전체적인 구조 확인(행 개수 150개(0~149), 열 개수 5개, 열 별 결측치 개수)
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
#Sumerizing 데이터프레임
# - min()
iris.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [ ]:
# - quantile(백분위수)
iris.quantile(0.25)

sepal_length    5.1
sepal_width     2.8
petal_length    1.6
petal_width     0.3
Name: 0.25, dtype: float64

In [ ]:
iris.quantile(0.75)

sepal_length    6.4
sepal_width     3.3
petal_length    5.1
petal_width     1.8
Name: 0.75, dtype: float64

# 02. 데이터프레임 다루기

**Indexing & Slicing**

In [ ]:
#loc - 라벨을 통한 인덱싱
iris.loc[0:1,['sepal_length','petal_length','species']]

   sepal_length  petal_length species
0           5.1           1.4  setosa
1           4.9           1.4  setosa

In [ ]:
#iloc
iris.iloc[0:1,0:3]

   sepal_length  sepal_width  petal_length
0           5.1          3.5           1.4

In [ ]:
#Boolean indexing
#[]연산자 내에 불린 조건을 입력 - 조건에 해당하는 행 출력

In [ ]:
iris['sepal_width']>4

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: sepal_width, Length: 150, dtype: bool

In [ ]:
iris[iris['sepal_width']>4]

    sepal_length  sepal_width  petal_length  petal_width species
15           5.7          4.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa

In [ ]:
iris[iris['sepal_length'].isin([5.0,5.1])]

    sepal_length  sepal_width  petal_length  petal_width     species
0            5.1          3.5           1.4          0.2      setosa
4            5.0          3.6           1.4          0.2      setosa
7            5.0          3.4           1.5          0.2      setosa
17           5.1          3.5           1.4          0.3      setosa
19           5.1          3.8           1.5          0.3      setosa
21           5.1          3.7           1.5          0.4      setosa
23           5.1          3.3           1.7          0.5      setosa
25           5.0          3.0           1.6          0.2      setosa
26           5.0          3.4           1.6          0.4      setosa
35           5.0          3.2           1.2          0.2      setosa
39           5.1          3.4           1.5          0.2      setosa
40           5.0          3.5           1.3          0.3      setosa
43           5.0          3.5           1.6          0.6      setosa
44           5.1          3.8           1.9          0.4      setosa
46           5.1          3.8           1.6          0.2      setosa
49           5.0          3.3           1.4          0.2      setosa
60           5.0          2.0           3.5          1.0  versicolor
93           5.0          2.3           3.3          1.0  versicolor
98           5.1          2.5           3.0          1.1  versicolor

In [ ]:
iris[iris['species']=='setosa'][['sepal_width','sepal_length']].head()

   sepal_width  sepal_length
0          3.5           5.1
1          3.0           4.9
2          3.2           4.7
3          3.1           4.6
4          3.6           5.0

In [ ]:
iris[(iris['sepal_width']>3)&(iris['species']=='setosa')].head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [ ]:
#Query 함수

In [ ]:
iris.query('sepal_length > 5').head(3)

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa

In [ ]:
#외부 변수명 또는 함수명 사용시 앞에 @붙여 사용한다. 
length = 5
iris.query('sepal_length == @length').head(3)

    sepal_length  sepal_width  petal_length  petal_width species
4            5.0          3.6           1.4          0.2  setosa
7            5.0          3.4           1.5          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa

In [ ]:
iris.query('species == "setosa" and sepal_length in [5.0,5.1]').head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
7           5.0          3.4           1.5          0.2  setosa

In [ ]:
str_expr = "sepal_width == 3.5"
iris.query(str_expr).head(3)

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa
27           5.2          3.5           1.5          0.2  setosa

**sorting**

In [ ]:
#sort_values(by = '기준 열')
iris.sort_values(by='sepal_width')

     sepal_length  sepal_width  petal_length  petal_width     species
60            5.0          2.0           3.5          1.0  versicolor
62            6.0          2.2           4.0          1.0  versicolor
119           6.0          2.2           5.0          1.5   virginica
68            6.2          2.2           4.5          1.5  versicolor
41            4.5          2.3           1.3          0.3      setosa
..            ...          ...           ...          ...         ...
16            5.4          3.9           1.3          0.4      setosa
14            5.8          4.0           1.2          0.2      setosa
32            5.2          4.1           1.5          0.1      setosa
33            5.5          4.2           1.4          0.2      setosa
15            5.7          4.4           1.5          0.4      setosa

[150 rows x 5 columns]

**function mapping**

In [ ]:
#apply와 lambda를 통한 매핑
iris['species'] = iris['species'].apply(lambda x : 1 if x == 'setosa' else 0)
iris

     sepal_length  sepal_width  petal_length  petal_width  species
0             5.1          3.5           1.4          0.2        1
1             4.9          3.0           1.4          0.2        1
2             4.7          3.2           1.3          0.2        1
3             4.6          3.1           1.5          0.2        1
4             5.0          3.6           1.4          0.2        1
..            ...          ...           ...          ...      ...
145           6.7          3.0           5.2          2.3        0
146           6.3          2.5           5.0          1.9        0
147           6.5          3.0           5.2          2.0        0
148           6.2          3.4           5.4          2.3        0
149           5.9          3.0           5.1          1.8        0

[150 rows x 5 columns]

**group aggregation**

In [ ]:
#groupby를 통한 데이터집계
iris.groupby('species')['sepal_width'].sum()

species
0    287.2
1    171.4
Name: sepal_width, dtype: float64

In [ ]:
#reset_index() - 데이터 프레임으로 결과 추출
iris.groupby('species')['sepal_width'].sum().reset_index()

   species  sepal_width
0        0        287.2
1        1        171.4

# 03. 데이터프레임 합치기

**데이터프레임 생성**

In [ ]:
Q1 = pd.DataFrame([[1,2,3],[4,5,6]], columns = list('abc'))
Q2 = pd.DataFrame([[11,22,33],[44,55,66]],columns = list('bcd'))
print(Q1)
print('------------------------------------')
print(Q2)

   a  b  c
0  1  2  3
1  4  5  6
------------------------------------
    b   c   d
0  11  22  33
1  44  55  66

**concat(연결)**

In [ ]:
#밑으로 불이기
pd.concat([Q1,Q2])

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
0  NaN  11  22  33.0
1  NaN  44  55  66.0

In [ ]:
#순서있는 인덱스 원할 경우
pd.concat([Q1,Q2], ignore_index=True)

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  NaN  11  22  33.0
3  NaN  44  55  66.0

In [ ]:
#공통으로 가지고 있는 열 'b'와 'c'로
pd.concat([Q1,Q2],join='inner')

    b   c
0   2   3
1   5   6
0  11  22
1  44  55

**merge(병합)**

In [ ]:
#공통된 열이 있을때 옆으로 붙이기
S1 = pd.DataFrame([[1,'aa',3],[4,'bb',5]],columns=list('abc'))
S2 = pd.DataFrame([[11,'bb'],[22,'aa']],columns=list('db'))
print(S1)
print(S2)
print('-------------------------')
#'b'열을 기준으로 옆으로 붙이기
S3 = pd.merge(S1,S2, on = 'b') 
print(S3)

   a   b  c
0  1  aa  3
1  4  bb  5
    d   b
0  11  bb
1  22  aa
-------------------------
   a   b  c   d
0  1  aa  3  22
1  4  bb  5  11

In [ ]:
V1 = pd.DataFrame([[1,'aa',3],[4,'bb',5]],columns=list('abc'))
V2 = pd.DataFrame([[11,'cc'],[22,'aa']],columns=list('db'))
print(V1)
print(V2)

   a   b  c
0  1  aa  3
1  4  bb  5
    d   b
0  11  cc
1  22  aa

In [ ]:
#공통된 열이 있을떄 옆으로 붙이기
V3 = pd.merge(V1, V2, how = 'inner') #공통 열 'b'를 기준으로 교집합
print(V3)
print('-----------------')
V4 = pd.merge(V1, V2, how = 'outer') #공통 열 'b'를 기준으로 합집합
print(V4)
print('-----------------')
V5 = pd.merge(V1,V2, how = 'left') #왼쪽 데이터프레임 'V1' 키열에 속하는 데이터 값을 기준으로 병합
print(V5)
print('-----------------')
V6 = pd.merge(V1,V2, how = 'right') #오른쪽 데이터프레임 'V2' 키열에 속하는 데이터 값을 기준으로 병합
print(V6)

   a   b  c   d
0  1  aa  3  22
-----------------
     a   b    c     d
0  1.0  aa  3.0  22.0
1  4.0  bb  5.0   NaN
2  NaN  cc  NaN  11.0
-----------------
   a   b  c     d
0  1  aa  3  22.0
1  4  bb  5   NaN
-----------------
     a   b    c   d
0  NaN  cc  NaN  11
1  1.0  aa  3.0  22

**join(연결)**

In [ ]:
df1 = pd.DataFrame({'a':['a0','a1','a2'],'b':['b0','b1','b2'],'c':['c0','c1','c2']}, index=[0,1,2])
df2 = pd.DataFrame({'e':['e0','e1','e2'],'f':['f0','f1','f2'],'g':['g0','g1','g2']}, index=[1,2,3])
#행 인덱스를 기준으로 결합
df3 = df1.join(df2)
df3

    a   b   c    e    f    g
0  a0  b0  c0  NaN  NaN  NaN
1  a1  b1  c1   e0   f0   g0
2  a2  b2  c2   e1   f1   g1

# 04. 결측치 처리하기

**결측치 확인**

In [83]:
titanic=sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [106]:
df = titanic[titanic['sibsp'] == 0][['pclass','age','sibsp','fare','class']]
df

     pclass   age  sibsp     fare   class
2         3  26.0      0   7.9250   Third
4         3  35.0      0   8.0500   Third
5         3   NaN      0   8.4583   Third
6         1  54.0      0  51.8625   First
8         3  27.0      0  11.1333   Third
..      ...   ...    ...      ...     ...
885       3  39.0      0  29.1250   Third
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[608 rows x 5 columns]

In [95]:
#isnull().sum()
df.isnull().sum()

pclass      0
age       137
sibsp       0
fare        0
class       0
dtype: int64

**결측치 처리**

In [ ]:
#dropna - 결측치가 있는 행을 제거
#any & all

In [107]:
df.dropna(how = 'any').shape

(471, 5)

In [108]:
df.dropna(how = 'any').reset_index()

     index  pclass   age  sibsp     fare   class
0        2       3  26.0      0   7.9250   Third
1        4       3  35.0      0   8.0500   Third
2        6       1  54.0      0  51.8625   First
3        8       3  27.0      0  11.1333   Third
4       11       1  58.0      0  26.5500   First
..     ...     ...   ...    ...      ...     ...
466    885       3  39.0      0  29.1250   Third
467    886       2  27.0      0  13.0000  Second
468    887       1  19.0      0  30.0000   First
469    889       1  26.0      0  30.0000   First
470    890       3  32.0      0   7.7500   Third

[471 rows x 6 columns]

In [109]:
df.dropna(how = 'all').shape

(608, 5)

In [110]:
df.dropna(how = 'all').reset_index()

     index  pclass   age  sibsp     fare   class
0        2       3  26.0      0   7.9250   Third
1        4       3  35.0      0   8.0500   Third
2        5       3   NaN      0   8.4583   Third
3        6       1  54.0      0  51.8625   First
4        8       3  27.0      0  11.1333   Third
..     ...     ...   ...    ...      ...     ...
603    885       3  39.0      0  29.1250   Third
604    886       2  27.0      0  13.0000  Second
605    887       1  19.0      0  30.0000   First
606    889       1  26.0      0  30.0000   First
607    890       3  32.0      0   7.7500   Third

[608 rows x 6 columns]

In [ ]:
#fillna - 결츨치를 다른 값으로 대체

In [105]:
#평균값(이외에 9, 중간값, 최빈값 등으로 대체)
df.fillna(df.mean(), inplace = True)  #inplace = True  바로 df 데이터프레임에 저장
df

     pclass        age  sibsp     fare   class
2         3  26.000000      0   7.9250   Third
4         3  35.000000      0   8.0500   Third
5         3  31.397558      0   8.4583   Third
6         1  54.000000      0  51.8625   First
8         3  27.000000      0  11.1333   Third
..      ...        ...    ...      ...     ...
885       3  39.000000      0  29.1250   Third
886       2  27.000000      0  13.0000  Second
887       1  19.000000      0  30.0000   First
889       1  26.000000      0  30.0000   First
890       3  32.000000      0   7.7500   Third

[608 rows x 5 columns]

In [111]:
#method = 'bfill' - 이후 값으로 대체 
df.fillna(method = 'bfill')

     pclass   age  sibsp     fare   class
2         3  26.0      0   7.9250   Third
4         3  35.0      0   8.0500   Third
5         3  54.0      0   8.4583   Third
6         1  54.0      0  51.8625   First
8         3  27.0      0  11.1333   Third
..      ...   ...    ...      ...     ...
885       3  39.0      0  29.1250   Third
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[608 rows x 5 columns]

In [112]:
#method = 'ffill' - 이전 값으로 대체 
df.fillna(method = 'ffill')

     pclass   age  sibsp     fare   class
2         3  26.0      0   7.9250   Third
4         3  35.0      0   8.0500   Third
5         3  35.0      0   8.4583   Third
6         1  54.0      0  51.8625   First
8         3  27.0      0  11.1333   Third
..      ...   ...    ...      ...     ...
885       3  39.0      0  29.1250   Third
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[608 rows x 5 columns]

In [113]:
#열 별 다른 값으로 대체
df.fillna({'age':0, 'fare':1})

     pclass   age  sibsp     fare   class
2         3  26.0      0   7.9250   Third
4         3  35.0      0   8.0500   Third
5         3   0.0      0   8.4583   Third
6         1  54.0      0  51.8625   First
8         3  27.0      0  11.1333   Third
..      ...   ...    ...      ...     ...
885       3  39.0      0  29.1250   Third
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[608 rows x 5 columns]